[
	{
		"agenda_details": {
			"start_time": "2024-06-13T09:00+02:00",
			"end_time": "2024-06-13T10:30+02:00",
			"minutes": 90,
			"type": "break"
		},
		"break": {
			"title": "Overflow Room",
			"inline_abstract": "",
			"location": "",
			"description": ""
		}
	},
	{
		"agenda_details": {
			"start_time": "2024-05-01T10:30+02:00",
			"end_time": "2024-05-01T11:10+02:00",
			"minutes": 40,
			"type": "talk",
			"keynote": false
		},
		"talk": {
			"name": "NTT DATA",
			"avatar": "",
			"location": "",
			"bio": "",
			"twitter": "",
			"url": "https://www.nttdata.com/global/en/",
			"shirt_size": "Women's M",
			"job_title": "",
			"title": "Sponsor Talk",
			"abstract": "Talk abstract incoming...",
			"description": "Coming soon",
			"notes": "",
			"audience_level": "All",
			"tags": []
		}
	},
	{
		"agenda_details": {
			"start_time": "2024-05-01T11:15+02:00",
			"end_time": "2024-05-01T11:35+02:00",
			"minutes": 20,
			"type": "talk",
			"keynote": false
		},
		"talk": {
			"name": "Katie Kennedy, Ciaran Flaherty",
			"avatar": "./speakers/flaherty_ciaran.jpg",
			"location": "Unknown",
			"bio": "I'm a 28 year old from Ireland and I went to university in Gal way where I was one of the few females in my computer science and Information Technology degree. My love for new  and exciting technology led me to specialise in cloud computing. Throughout my career, I have focused on leveraging the power of cloud technology to drive innovation and efficiency. I am passionate about exploring the limitless possibilities that the cloud offers and finding creative solutions to complex problems. In my free time, you can often find me immersing myself in the world of The Witcher,  whether its through the PlayStation, tv series or books it is a fantasy series that has captured my imagination.",
			"twitter": "",
			"url": "https://www.linkedin.com/in/katie-kennedy-irl/",
			"organization": "Fidelity Investments",
			"shirt_size": "Women's M",
			"talk_format": "Short Talk (20 minutes)",
			"title": "Building a production ready serverless platform",
			"abstract": "Learn how Fidelity supports 100s of applications through its scalable serverless architecture to reduce operational complexity, minimise disruption and time to recovery using Infrastructure as code pipelines and AWS services to enable highly available capabilities across our organisation.",
			"description": "Learn how Fidelity supports 100s of applications through its scalable serverless architecture to reduce operational complexity, minimise disruption and time to recovery using Infrastructure as code pipelines and AWS services to enable highly available capabilities across our organisation. Join us for a presentation on building a highly available and secure API infrastructure with AWS. Discover how AWS services can revolutionize your API management and ensure seamless connectivity for your business.",
			"audience_level": "Intermediate",
			"tags": [
				"aws",
				"disasterrecovery",
				"route53",
				"lambda"
			]
		}
	},
	{
		"agenda_details": {
			"start_time": "2024-06-13T11:40+02:00",
			"end_time": "2024-06-13T12:00+02:00",
			"minutes": 20,
			"type": "break"
		},
		"break": {
			"title": "Coffee Break",
			"inline_abstract": "",
			"location": "",
			"description": ""
		}
	},
	{
		"agenda_details": {
			"start_time": "2024-05-01T12:00+02:00",
			"end_time": "2024-05-01T12:40+02:00",
			"minutes": 40,
			"type": "talk"
		},
		"talk": {
			"name": "BeSharp",
			"avatar": "",
			"location": "",
			"bio": "",
			"twitter": "",
			"url": "https://www.besharp.it/",
			"shirt_size": "Men's M",
			"name_2": null,
			"email_2": null,
			"avatar_2": null,
			"location_2": null,
			"bio_2": null,
			"twitter_2": null,
			"url_2": null,
			"organization_2": null,
			"shirt_size_2": null,
			"title": "Sponsor Talk",
			"abstract": "Talk abstract incoming...",
			"description": "Coming soon",
			"audience_level": "Beginner",
			"tags": []
		}
	},
	{
		"agenda_details": {
			"start_time": "2024-05-01T12:45+02:00",
			"end_time": "2024-05-01T13:05+02:00",
			"minutes": 20,
			"type": "talk"
		},
		"talk": {
			"name": "Matthew Wilson",
			"avatar": "https://imgur.com/X3Z3LhQ.jpeg",
			"location": "Unknown",
			"bio": "Distinguished Engineer at Instil and AWS Community Builder.\r\nEnjoys talking about serverless, cars and coffee. \r\nHusband to Rebekah, father to Joy Tabitha, both of which think I copy paste for a living. ",
			"twitter": "matt_codes",
			"url": "https://dev.to/matthewwilson",
			"organization": "Instil Software",
			"shirt_size": "Men's XL",
			"title": "Zero to Serverless car insurance",
			"abstract": "At the start of 2021 we began an ambitious project, building a car insurance platform from scratch using serverless technology on AWS. This talk describes our Serverless education, warts and all, in the hope that you can learn from it.",
			"description": "Over the past 2 years we learnt a lot about what it takes to build a Serverless platform: what it means to be Serverless-first, what works well, what doesn't, but above all we learnt to love the Serverless offering on AWS. This talk describes our team's Serverless journey, how we encouraged developers to adopt a Serverless mindset, how we enlightened them that writing less code is better and how we enabled them to deploy to production with confidence.",
			"notes": "I'm the tech lead for a fully serverless car insurance platform running on AWS. I've been a developer for over a decade now with half of that experience using AWS. This project opened my eyes to the power of serverless which has lead me to being accepted into the AWS Community Builders program in the serverless category.",
			"audience_level": "All",
			"tags": [
				"Amazon Web Services",
				"Serverless"
			]
		}
	},
	{
		"agenda_details": {
			"start_time": "2024-05-01T13:10+02:00",
			"end_time": "2024-05-01T13:50+02:00",
			"minutes": 40,
			"type": "talk"
		},
		"talk": {
			"name": "Louis Pinsard",
			"avatar": "https://imgur.com/nvtwTV0.png",
			"bio": "Louis spent four years honing his skills at Theodo, where he worked on a variety of serverless projects as part of the Kumo team of serverless experts. In 2022, he decided to venture out on his own and founded Dialog, where he currently serves as the CTO. At Dialog, Louis has implemented a serverless architecture, leveraging his extensive experience and deep love for the technology.\r\n\r\nIn his free time, Louis enjoys cycling in the French Alps and playing squash in Paris.",
			"twitter": "LouisPinsard",
			"url": "https://www.linkedin.com/in/louis-pinsard/",
			"organization": "Dialog",
			"shirt_size": "Men's M",
			"talk_format": "Talk (40 minutes)",
			"title": "Should you bet on Serverless as an early stage start-up (or new team with great ambition)?",
			"abstract": "Serverless: A startup's secret weapon or a complex challenge? I've been there and I'm here to share. Join me for real stories, lessons learned, and to see if serverless can fuel your ambitious journey.",
			"description": "Serverless: A startup's secret weapon or a complex challenge? I've been there and I'm here to share. When starting my company, I firmly believed that serverless was an excellent option for numerous reasons: zero infrastructure costs when the platform has no active clients, effortless scalability from day 1, the ability to personally manage the infrastructure, delaying the need to recruit a DevOps engineer for an extended period. In this presentation, I will discuss the outcomes of these points and share the insights I've gained over the past few months: how to handle the necessary non-serverless downstream services, the real impact of scaling from zero to high traffic on a serverless API and how to prepare for it, strategies for successfully training three novice software engineers in AWS serverless technology.",
			"notes": "In the talk I will give practical advice on the following subjects:\r\n- Infrastructure as code: serverless framework/cdk\r\n- monitoring and alerting with Cloudwatch\r\n- how to use Lambda and SQS to better handle downstream non-serverless API\r\n\r\nWith a track record of launching five diverse products using AWS serverless technology across my startup and various clients including scale-ups and Parisian public transport, my experience spans a broad spectrum. I've effectively collaborated with both serverless experts and novices, which has enriched my understanding of its practical applications and challenges.\r\n\r\nMy hands-on involvement in developing, scaling, and optimizing serverless solutions underlines my expertise. This experience is complemented by my ability to demystify complex concepts for teams at different skill levels, making me adept at not just implementing but also teaching serverless technology.",
			"audience_level": "All",
			"tags": [
				"aws"
			]
		}
	},
	{
		"agenda_details": {
			"start_time": "2024-05-01T14:00+02:00",
			"end_time": "2024-05-01T15:00+02:00",
			"minutes": 60,
			"type": "break"
		},
		"break": {
			"title": "Lunch Break",
			"inline_abstract": "Take a break and grab a lunch",
			"location": "Cafeteria",
			"description": "(dropdown) menu The menu is: fried rice, chicken curry, and salad"
		}
	},
	{
		"agenda_details": {
			"start_time": "2024-05-01T15:00+02:00",
			"end_time": "2024-05-01T15:40+02:00",
			"minutes": 40,
			"type": "talk",
			"keynote": false
		},
		"talk": {
			"name": "Slobodan Stojanović",
			"avatar": "./speakers/stojanovic_slobodan.jpeg",
			"location": "Belgrade, Serbia",
			"bio": "Slobodan Stojanović is the CTO and co-founder of Vacation Tracker, an application that simplifies employee leave and absence management for organizations. He is based in Belgrade and is the JS Belgrade meetup co-organizer. Slobodan is an AWS Serverless Hero and co-author of the “Serverless Applications with Node.js” book, published by Manning Publications.",
			"twitter": "slobodan_",
			"url": "https://slobodan.me",
			"organization": "Vacation Tracker",
			"shirt_size": "Men's 2XL",
			"title": "From 1 to 250 Lambda Functions in Production: Evolving a Startup Serverless Architecture",
			"abstract": "Building a serverless function or an API is easy. However, things get more complicated as your application grows. What works for a few functions often doesn't work for hundreds of functions and services. As your app grows, you'll need to evolve your architecture, deployment, monitoring, and tooling.",
			"description": "Building a serverless function or an API is easy. However, things get a bit more complicated as your application grows. What works for a few functions often doesn't work for hundreds of functions and services. As your application grows, you'll need to evolve your architecture, deployment, monitoring, and tooling. This talk is a case study of the serverless startup's architecture evolution. We started with a single Lambda function in early 2018 and evolved our application through multiple stages and architectures. Currently, the application uses CQRS with GraphQL and 250 Lambda functions serving millions of requests. We faced and solved many issues during the last four years, learned many things, and managed to keep our infrastructure costs low (just 1% of our MRR). And we do everything with a small team of fullstack developers without dedicated ops.",
			"notes": "",
			"audience_level": "Intermediate",
			"tags": [
				"Graphql",
				"cqrs",
				"architecture",
				"Serverless",
				"SaaS",
				"aws"
			]
		}
	},
	{
		"agenda_details": {
			"start_time": "2024-05-01T15:45+02:00",
			"end_time": "2024-05-01T16:05+02:00",
			"minutes": 20,
			"type": "talk"
		},
		"talk": {
			"name": "Simon Hanmer",
			"avatar": "https://imgur.com/fsbXVvh.png",
			"location": "Scotland, United Kingdon",
			"bio": "Starting out in a very traditional background in the data-centres of the fabled M4 corridor, Simon eventually realised it was time to give up on the problems of manually babysitting servers, racks and UPS's and migrated to the Cloud (and in the process, the Scottish Highlands) and now works to enable clients to transition their workloads, processes and swag requirements to the same route. Simon is a member of the AWS Community builder program, and these days enjoys coaching and mentoring as much as get hands-on with code, automation and head-scratching.",
			"twitter": "simonhanmer",
			"url": "https://headforthe.cloud",
			"organization": "GlobalLogic UK\u0026I",
			"shirt_size": "Men's 2XL",
			"title": "The case of the missing S3 keys",
			"abstract": "Imagine a system designed to process millions of events per day, but as use grows, data mysteriously seems to disappear, only to re-appear later. We'll talk about the what, why and how we investigated the symptoms, overturned some assumptions and finally delivered a resilient, serverless solution.",
			"description": "Imagine a system designed to process millions of events per day, but as use grows, data mysteriously seems to disappear, only to re-appear later. What was causing the system to break? We'll talk about the system architecture, how we noticed the failures and how we investigated the issue, overturned some assumptions and finally delivered a resilient, serverless solution that handled millions of events per day.",
			"notes": "We were asked to help one of our clients understand why a system was displaying odd failures in their event processing system. The system had been rigorously tested but as we moved to a live environment where we processed millions of records per day, we saw some a tiny number of events weren't being processed. We'll discuss how we investigated the solution using the native AWS tools, ruled out some causes, but were puzzled by the provider's documentation before realising that the devil was in the detail of the documentation. We'll then describe the original solution, and how a serendipitous update allowed us to provide a simpler, more robust solution.",
			"audience_level": "All",
			"tags": [
				"AWS",
				"Serverless"
			]
		}
	},
	{
		"agenda_details": {
			"start_time": "2024-06-13T16:10+02:00",
			"end_time": "2024-06-13T16:30+02:00",
			"minutes": 20,
			"type": "break"
		},
		"break": {
			"title": "Coffee Break",
			"inline_abstract": "",
			"location": "",
			"description": ""
		}
	},
	{
		"agenda_details": {
			"start_time": "2024-05-01T16:30+02:00",
			"end_time": "2024-05-01T17:10+02:00",
			"minutes": 40,
			"type": "talk"
		},
		"talk": {
			"name": "Fabrizio Gattuso",
			"avatar": "https://imgur.com/LjO2Tgt.jpg",
			"location": "Berlin",
			"bio": "I'm a tech enthusiast with a pretty eclectic journey. Beginning my career in the home automation (domotic) sector, I later pivoted to study Computer Science with a focus on embedded and IoT solutions. My research journey involved delving into power-saving strategies for embedded devices and exploring innovative wireless communication protocols for energy efficiency. In a notable chapter of my career, I contributed to building solutions in the Underwater Internet of Things sector as part of a spinoff from Sapienza University known as Wsense. There, I established the AWS team from the ground up, showcasing my leadership and technical skills. Currently residing in Germany, I have transitioned to Nordcloud, a leading consultancy company. As a Cloud Solution Architect and People Lead for the AWS team, I bring a wealth of experience and a passion for driving innovation and excellence in cloud solutions. Beyond the tech realm, you'll find me exploring the great outdoors through endurance sports like biking (road and gravel), road and trail running, and hiking. I'm equally passionate about the finer things in life such as craft beer, wine and good food.",
			"twitter": "",
			"url": "https://www.linkedin.com/in/fabrizio-gattuso-273064a3/",
			"organization": "Nordcloud",
			"shirt_size": "Men's M",
			"title": "Solving data challenges embracing serverless simplicity",
			"abstract": "Embark on a tech journey bypassing traditional data tools for serverless simplicity with AWS Athena, Step Functions, and Lambda. Seamlessly handle terabytes of logs, turning complexity into a smooth, customer-centric data experience. No heavy engineering, just practical insights from real life.",
			"description": "Embark on a transformative tech journey, sidestepping traditional data tools for a serverless experience with AWS Athena, Step Functions, and Lambda. Seamlessly manage terabytes of CloudWatch and CloudTrail logs, employing diverse file formats and parallel execution. Witness the alchemy of compressing and transforming data, turning complexity into a low code (no-ETL) pipeline tailored on the customer use case. This journey not only delivers practical insights but also unveils cost-saving strategies, ensuring efficiency and value to the solution. Leave behind the complexities of heavy engineering and enter a realm where serverless simplicity converges with optimized data processing. Now, individuals with minimal data experience can effortlessly construct products with ease.",
			"notes": "I am grateful for the opportunity to be considered as your presenter. As an AWS Community Builder in the Serverless domain and a Cloud Solution Architect, my journey mirrors a fusion of Italian heritage, reflecting my professional experiences in both Italy and Germany. This diverse background has profoundly influenced my approach to crafting serverless solutions, enabling me to contribute meaningfully to global and local tech communities alike. I am excited about sharing insights that not only highlight my international experiences but also establish a genuine connection with the Italian tech landscape. Moreover, my professional journey spans startup environments, research endeavors, and consultancy roles, providing a well-rounded perspective on diverse facets of the industry.",
			"audience_level": "Intermediate",
			"tags": [
				"aws",
				"data",
				"python"
			]
		}
	},
	{
		"agenda_details": {
			"start_time": "2024-06-13T17:15+02:00",
			"end_time": "2024-06-13T17:55+02:00",
			"minutes": 40,
			"type": "break"
		},
		"break": {
			"title": "Overflow Room",
			"inline_abstract": "",
			"location": "",
			"description": ""
		}
	},

	{
		"agenda_details": {
			"start_time": "2024-06-13T18:00+02:00",
			"end_time": "2024-06-13T18:15+02:00",
			"minutes": 15,
			"type": "break"
		},
		"break": {
			"title": "Final remarks",
			"inline_abstract": "",
			"location": "",
			"description": ""
		}
	},
	{
		"agenda_details": {
			"start_time": "2024-06-13T18:15+02:00",
			"end_time": "2024-06-13T21:00+02:00",
			"minutes": 15,
			"type": "break"
		},
		"break": {
			"title": "Happy hour",
			"inline_abstract": "",
			"location": "",
			"description": ""
		}
	}
]