[
  {
    "agenda_details": {
      "start_time": "2025-10-21T09:00+02:00",
      "end_time": "2025-10-21T09:30+02:00",
      "minutes": 30,
      "type": "break"
    },
    "break": {
      "title": "Main Stage Overflow",
      "inline_abstract": "Follow the main stage presentations in this overflow room",
      "location": "Discovery Track Room",
      "description": "This session follows the main stage content. Please refer to the main track for details."
    }
  },
  {
    "agenda_details": {
      "start_time": "2025-10-21T09:30+02:00",
      "end_time": "2025-10-21T09:40+02:00",
      "minutes": 10,
      "type": "break"
    },
    "break": {
      "title": "Main Stage Overflow",
      "inline_abstract": "Follow the main stage presentations in this overflow room",
      "location": "Discovery Track Room",
      "description": "This session follows the main stage content. Please refer to the main track for details."
    }
  },
  {
    "agenda_details": {
      "start_time": "2025-10-21T09:40+02:00",
      "end_time": "2025-10-21T10:20+02:00",
      "minutes": 40,
      "type": "break"
    },
    "break": {
      "title": "Main Stage Overflow",
      "inline_abstract": "Follow the main stage presentations in this overflow room",
      "location": "Discovery Track Room",
      "description": "This session follows the main stage content. Please refer to the main track for details."
    }
  },
  {
    "agenda_details": {
      "start_time": "2025-10-21T10:25+02:00",
      "end_time": "2025-10-21T11:05+02:00",
      "minutes": 40,
      "type": "talk"
    },
    "talk": {
      "name": "Gabriele Biagini",
      "avatar": "/speakers/gabriele-biagini.jpeg",
      "location": "Munich",
      "bio": "Solutions Architect @ AWS",
      "twitter": "",
      "url": "#",
      "organization": "AWS",
      "job_title": "",
      "title": "Let's Agree to Disagree: Managing Conflicts in Multi-State Scenarios",
      "description": "Whether you're building offline-first mobile apps, collaborative editors, or edge-deployed services, multiple users and devices may interact with the same data independently. Network partitions, latency, and asynchronous workflows guarantee that state will drift. The real challenge? Reuniting these divergent states without breaking user expectations or corrupting intent.\nWe'll explore common sync strategies and focus on Conflict-Free Replicated Data Types (CRDTs) for building systems that automatically converge over time.\nDiving deep into architectural patterns for tracking, persisting, and acknowledging operations (eg. how to deal with unacknowledged updates, resends, and client-side reconciliation), how to balance consistency, latency, and user experience when true consensus isn't possible or practical.",
      "abstract": "In distributed systems, divergence is inevitable - especially in offline-first apps, multi-device sync, or edge-first architectures. How do you manage conflicts when multiple versions of the same data emerge? Let's build eventually convergent systems without losing data or user intent.",
      "audience_level": "Advanced",
      "tags": [
        "aws",
        "serverless"
      ]
    }
  },
  {
    "agenda_details": {
      "start_time": "2025-10-21T11:10+02:00",
      "end_time": "2025-10-21T11:50+02:00",
      "minutes": 40,
      "type": "talk"
    },
    "talk": {
      "name": "Almir Zulic",
      "avatar": "/speakers/almir-zulic.jpeg",
      "location": "Sarajevo, Bosnia and Herzegovina",
      "bio": "Almir Zulic is a principal developer at Serverless Guru with 28 years of IT experience, \nspecializing in cloud technologies and focusing on serverless development and security for \nenterprise customers on AWS. ",
      "twitter": "",
      "url": "#",
      "organization": "Serverless Guru",
      "job_title": "",
      "title": "Living in harmony with the data: CDC to Flink on MSK with Aurora and S3 Iceberg",
      "description": "To set the stage, we will start with a real-world scenario: a retailer or logistics provider ingesting \npartner messages and database changes from many systems and regions. Events arrive in \ndifferent shapes and at different frequencies, meaning that spikes in traffic are possible.  \n \nThere are several interested parties involved:  \n  Operations need a live view to run a business.  \n  Analytics needs history and time travel for the reporting.  \n  Downstream systems and DevOps need something that scales reliably and with \npredictable cost.",
      "abstract": "In todays world, where data is at the core of every business, access to data changes in near \nreal time has almost become a standard. To satisfy this requirement, technical teams need to \nprovide copies of operational data across clusters and regions without duplicates or broken \nconsumers. This is not an easy task, especially when working at scale. \n \nThis talk walks through a practical pattern that uses AWS DMS for ongoing replication of \nchanges from the source database using CDC (Change Data Capture) to stream data to \nAmazon MSK, transforms and enriches it with Apache Flink, and performs idempotent inserts \ninto Aurora MySQL for operations, while using the same pipeline to write to S3 Tables powered \nby Iceberg for history and time travel.  \n \nThe second half focuses on day-2 patterns for a harmonized schema that evolves safely without \nbreaking downstream systems and API contracts. We will talk about additive changes first, \nviews as contracts, dual-phase rollouts, idempotency, safe replays, and how Flink handles \nupstream schema drift. \n \nWe will finish with a live demo that applies all these patterns.",
      "audience_level": "",
      "tags": []
    }
  },
  {
    "agenda_details": {
      "start_time": "2025-10-21T11:50+02:00",
      "end_time": "2025-10-21T12:10+02:00",
      "minutes": 20,
      "type": "break"
    },
    "break": {
      "title": "Main Stage Overflow",
      "inline_abstract": "Follow the main stage presentations in this overflow room",
      "location": "Discovery Track Room",
      "description": "This session follows the main stage content. Please refer to the main track for details."
    }
  },
  {
    "agenda_details": {
      "start_time": "2025-10-21T12:10+02:00",
      "end_time": "2025-10-21T12:50+02:00",
      "minutes": 40,
      "type": "talk"
    },
    "talk": {
      "name": "Guillaume Blaquiere",
      "avatar": "/speakers/guillaume-blaquiere.png",
      "location": "Baillargues, France",
      "bio": "Guillaume is a Google Developer Expert on Cloud Platform since 2019 and works at Carrefour as Group Data Architect \n\nJava developer for more than 15 years, and despite positions of responsibilities, he has always kept his wish to create, develop, discover and test new solutions, especially in the Cloud, the machine learning or Python and Go language. \n\nInnovation addict and Google Cloud 3x certified, writer and speaker in his free time, he's fascinated by the serverless solution and all the \"usual\" problems that it solves.\n\nMore generally, he likes helping people stucks on Google Cloud; you can find him on Stack Overflow (guillaume-blaquiere), Medium (@guillaume-blaquiere) and Twitter (@gblaquiere)",
      "twitter": "gblaquiere",
      "url": "https://guillaume-blaquiere.medium.com/",
      "organization": "Carrefour",
      "job_title": "",
      "title": "How the agents have colonized Carrefour",
      "description": "The agents have started to conquer the world in 2025. Carrefour has been invaded too! And it changes the way of working, interacting and our velocity on different topics.\nCome to discover how it started, the different iteration and team impacted, and the plans for the future.\nLearn the different steps, our pain points and the quick wins. And get back to work to start the agentic conquest in your team!",
      "abstract": "Agentic is the new trend. RAG, LLM, Long context are cool buzz words. But how to productionize agents? How to integrate with Google Chat? Serverless helps us to serve this new use cases without expensive infra",
      "audience_level": "All",
      "tags": [
        "gcp",
        "serverless",
        "ai",
        "agentic"
      ]
    }
  },
  {
    "agenda_details": {
      "start_time": "2025-10-21T12:55+02:00",
      "end_time": "2025-10-21T13:15+02:00",
      "minutes": 20,
      "type": "talk"
    },
    "talk": {
      "name": "Alex Casalboni",
      "avatar": "/speakers/alex-casalboni.jpeg",
      "location": "Bologna",
      "bio": "Alex is a software engineer passionate about web technologies and music. He began working on web projects and sharing his experiences in 2011. His passion for programming spans different languages such as Python, JavaScript, and Rust, as well as the open-source world and startups. After spending 6 years helping developers and companies adopt cloud technologies, Alex returned to the startup life to help businesses adopt edge computing and WebAssembly at Edgee.",
      "twitter": "alex_casalboni",
      "url": "https://www.linkedin.com/in/alexcasalboni/",
      "organization": "TBD",
      "job_title": "",
      "title": "Cloud, edge, and WebAssembly: how to design extensible serverless architectures",
      "description": "In this session, we'll explore how WebAssembly can help you build extensible architecture by easily supporting untrusted third-party code, while proving a built-in serverless experience. As a case study, we'll share Edgee's journey building a global, latency-sensitive application using a multi-region, active-active serverless architecture spanning across AWS Lambda and edge computing deployments such as Fastly and Cloudflare. We'll cover our architecture decisions and how services like Lambda, API Gateway, and DynamoDB power a truly global app on 20+ regions, with a fantastic tradeoff between costs, resiliency, and performance.",
      "abstract": "This is a \"serverless in production\" use case, with real-world insights and a WebAssembly deep dive. As a small startup with limited infra budget, we run a global app with 100M+ invocations per month across 20+ regions, reaching enterprise-level reliability with less than $50 on AWS.",
      "audience_level": "Intermediate",
      "tags": [
        "aws",
        "serverless",
        "opensource",
        "webassembly"
      ]
    }
  },
  {
    "agenda_details": {
      "start_time": "2025-10-21T13:20+02:00",
      "end_time": "2025-10-21T14:00+02:00",
      "minutes": 40,
      "type": "talk"
    },
    "talk": {
      "name": "Paul Gledhill",
      "avatar": "/speakers/paul-gledhill.jpg",
      "location": "Unknown",
      "bio": "Paul Gledhill is the Serverless Engineering Lead at Lloyds Banking Group, where he is driving the adoption of serverless containers to enable the bank to simplify deployment, reduce operational overhead and empower teams to deliver faster with greater autonomy. With deep expertise across GCP, AWS, and Azure, Paul has a passion for pushing the boundaries of what's possible with serverless and DevOps practices.\n\nHe is an active contributor to the tech community, organising the Liverpool AWS User Group and the Manchester Google Developer Group, liking nothing more than getting engineers engineering. He frequently speaks at events to share his practical knowledge and break down complex topics into clear, actionable insights.",
      "twitter": "pg51pup",
      "url": "https://twitter.com/pg51pup",
      "organization": "Lloyds Banking Group",
      "job_title": "",
      "title": "Wait, GPUs can be Serverless too?! Yes, and Here's How!",
      "description": "AI is evolving fast'but deploying and scaling large models still feels like a DevOps nightmare. What if you could harness the power of GPUs without managing servers or paying for idle time?\n\nIn this talk, we'll explore the surprising answer to the question: \"Wait'GPUs can be serverless?!' (Spoiler: Yes, they can.) You'll see a real-time demo of running an open-source Large Language Model (Google's Gemma) using Ollama, packaged into a container, and deployed to Google Cloud Run with an NVIDIA L4 GPU.\n\nThis session will cut through the hype and give you real, hands-on knowledge. You'll learn:\n- Why serverless GPUs are a game-changer for AI inference workloads\n- How to configure and deploy GPU-enabled Cloud Run services\n- How to optimise container size and model startup for responsiveness\n- How to track GPU usage and memory to stay in control of cost\n\nWhether you're a developer, architect, or just AI-curious, you'll walk away ready to run LLMs at scale - without the infrastructure burden. No marketing, no hand-waving ' just a fast-paced, practical deep dive.",
      "abstract": "Think serverless can't handle GPUs? Think again! In this session, we'll bust that myth by live-deploying a Large Language Model on Google Cloud Run with full GPU acceleration. See how serverless is ready for the AI revolution.",
      "audience_level": "Intermediate",
      "tags": [
        "gcp",
        "serverless",
        "ai",
        "opensource"
      ]
    }
  },
  {
    "agenda_details": {
      "start_time": "2025-10-21T14:00+02:00",
      "end_time": "2025-10-21T15:00+02:00",
      "minutes": 60,
      "type": "break"
    },
    "break": {
      "title": "Main Stage Overflow",
      "inline_abstract": "Follow the main stage presentations in this overflow room",
      "location": "Discovery Track Room",
      "description": "This session follows the main stage content. Please refer to the main track for details."
    }
  },
  {
    "agenda_details": {
      "start_time": "2025-10-21T15:00+02:00",
      "end_time": "2025-10-21T15:30+02:00",
      "minutes": 30,
      "type": "talk"
    },
    "talk": {
      "name": "Davide De Sio",
      "avatar": "/speakers/davide-de-sio.jpeg",
      "location": "",
      "bio": "",
      "twitter": "",
      "url": "https://www.linkedin.com/in/desiodavide",
      "organization": "Eleva",
      "job_title": "",
      "title": "Serverless to the rescue: generative AI architectural patterns",
      "description": "If you’re wondering how to integrate GenAI APIs, deploy RAG pipelines, run MCP servers or spin up AI agents without drowning in infrastructure, this talk is for you. We’ll show why serverless is the natural match for Generative AI: flexible, quick to adapt, designed to orchestrate. Build faster, scale seamlessly, and keep the focus on innovation instead of operations.",
      "abstract": "If you’re wondering how to integrate GenAI APIs, deploy RAG pipelines, run MCP servers or spin up AI agents without drowning in infrastructure, this talk is for you. We’ll show why serverless is the natural match for Generative AI: flexible, quick to adapt, designed to orchestrate. Build faster, scale seamlessly, and keep the focus on innovation instead of operations.",
      "audience_level": "All",
      "tags": []
    }
  },
  {
    "agenda_details": {
      "start_time": "2025-10-21T15:30+02:00",
      "end_time": "2025-10-21T16:00+02:00",
      "minutes": 30,
      "type": "talk"
    },
    "talk": {
      "name": "Eric Villa",
      "avatar": "/speakers/eric-villa.jpeg",
      "location": "",
      "bio": "I'm a Solutions Architect at beSharp, working on serverless-based middleware to support different cloud workloads. In recent years, I've contributed to open-source tools around AWS identity and access management. As an AWS Community Builder, I enjoy sharing knowledge, exchanging ideas, and learning from the community.",
      "twitter": "",
      "url": "https://www.linkedin.com/in/herrvilla/",
      "organization": "BeSharp",
      "job_title": "",
      "title": "Architetture event-driven a KM0: dal producer al consumer",
      "description": "Se vuoi esplorare come costruire e governare in modo efficace il cammino che un evento compie dal producer al consumer utilizzando Amazon EventBridge, allora questa sessione fa per te. Partiremo da alcuni concetti chiave che caratterizzano le architetture event-driven, per poi seguire il percorso completo di un evento: da quando viene generato, fino a quando viene consumato. Lo faremo esplorando come Amazon EventBridge gestisce routing, filtering e orchestrazione in un flusso end-to-end, con best practice e casi d'uso concreti per applicazioni serverless",
      "abstract": "Se vuoi esplorare come costruire e governare in modo efficace il cammino che un evento compie dal producer al consumer utilizzando Amazon EventBridge, allora questa sessione fa per te. Partiremo da alcuni concetti chiave che caratterizzano le architetture event-driven, per poi seguire il percorso completo di un evento: da quando viene generato, fino a quando viene consumato. Lo faremo esplorando come Amazon EventBridge gestisce routing, filtering e orchestrazione in un flusso end-to-end, con best practice e casi d'uso concreti per applicazioni serverless",
      "audience_level": "All",
      "tags": []
    }
  },
  {
    "agenda_details": {
      "start_time": "2025-10-21T16:10+02:00",
      "end_time": "2025-10-21T16:30+02:00",
      "minutes": 20,
      "type": "break"
    },
    "break": {
      "title": "Main Stage Overflow",
      "inline_abstract": "Follow the main stage presentations in this overflow room",
      "location": "Discovery Track Room",
      "description": "This session follows the main stage content. Please refer to the main track for details."
    }
  },
  {
    "agenda_details": {
      "start_time": "2025-10-21T16:30+02:00",
      "end_time": "2025-10-21T17:10+02:00",
      "minutes": 40,
      "type": "talk"
    },
    "talk": {
      "name": "Mariano Calandra",
      "avatar": "/speakers/mariano-calandra.jpg",
      "location": "Rome Area, Italy",
      "bio": "With a strong developer's background, Mariano daily helps companies that wish to modernize their applications embracing microservices and cloud native architectures. He's an AWS Authorized Instructor, a co-organizer of ServerlessDays and AWS UserGroup in Rome.\n\nIn his spare time he enjoys good music, reading, food and staying in front of the sea.",
      "twitter": "MarianoCalandra",
      "url": "https://marianocalandra.medium.com",
      "organization": "Zero12",
      "job_title": "",
      "title": "One way ticket to serverless hell ...and back!",
      "description": "In 2015, AWS Lambda ignited the serverless hype. Years later, the promise of seamless scaling and cheaper bills still enchant many teams, who believe a DynamoDB table and a couple of functions will be their silver bullet for every problem.\n\nUnfortunately, silver bullets don't exist and technologies won't fix broken architectures; nonetheless, serverless projects still fail due to these naive expectations. By distilling these failure stories, we will explore the dos and don'ts of serverless and discuss possible countermeasures.\n\nIf you are struggling with serverless, this session is for you!",
      "abstract": "The promise of easy scaling and lower costs sparked the serverless hype. But Lambda and DynamoDB alone won't fix bad choices: you're on a highway to hell!\n\nNo worries. In this talk, we'll pull the emergency brake, throw a hard U-turn and start climbing the stairway to heaven. Fasten your seatbelt!",
      "audience_level": "All",
      "tags": [
        "AWS",
        "Azure",
        "GCP",
        "Serverless"
      ]
    }
  },
  {
    "agenda_details": {
      "start_time": "2025-10-21T17:15+02:00",
      "end_time": "2025-10-21T17:55+02:00",
      "minutes": 40,
      "type": "break"
    },
    "break": {
      "title": "Main Stage Overflow",
      "inline_abstract": "Follow the main stage presentations in this overflow room",
      "location": "Discovery Track Room",
      "description": "This session follows the main stage content. Please refer to the main track for details."
    }
  },
  {
    "agenda_details": {
      "start_time": "2025-10-21T18:00+02:00",
      "end_time": "2025-10-21T18:15+02:00",
      "minutes": 15,
      "type": "break"
    },
    "break": {
      "title": "Main Stage Overflow",
      "inline_abstract": "Follow the main stage presentations in this overflow room",
      "location": "Discovery Track Room",
      "description": "This session follows the main stage content. Please refer to the main track for details."
    }
  }
]
