[
  {
    "agenda_details": {
      "start_time": "2025-10-21T09:00+02:00",
      "end_time": "2025-10-21T09:30+02:00",
      "minutes": 30,
      "type": "break"
    },
    "break": {
      "title": "Doors open, registration, breakfast",
      "inline_abstract": "",
      "location": "",
      "description": ""
    }
  },
  {
    "agenda_details": {
      "start_time": "2025-10-21T09:30+02:00",
      "end_time": "2025-10-21T09:40+02:00",
      "minutes": 10,
      "type": "break"
    },
    "break": {
      "title": "Welcome",
      "inline_abstract": "",
      "location": "",
      "description": ""
    }
  },
  {
    "agenda_details": {
      "start_time": "2025-10-21T09:40+02:00",
      "end_time": "2025-10-21T10:20+02:00",
      "minutes": 40,
      "type": "talk",
      "keynote": true
    },
    "talk": {
      "name": "Yan Cui",
      "avatar": "/speakers/yan_cui.jpg",
      "location": "London",
      "bio": "Yan is an experienced engineer who has run production workload at scale in AWS for 10 years. He has been an architect and principal engineer with a variety of industries ranging from banking, e-commerce, sports streaming to mobile gaming. He has worked extensively with AWS Lambda in production, and has been helping companies around the world adopt AWS and serverless as a consultant.\n\nYan is an [AWS Serverless Hero](https://aws.amazon.com/developer/community/heroes/yan-cui/) and a regular speaker at user groups and conferences internationally, and he is also the author of [Production-Ready Serverless](https://bit.ly/production-ready-serverless) and co-author of [Serverless Architectures on AWS 2nd Edition](https://www.manning.com/books/serverless-architectures-on-aws-second-edition), both by Manning. Yan also keeps an active blog at [https://theburningmonk.com](https://theburningmonk.com).",
      "twitter": "theburningmonk",
      "url": "http://theburningmonk.com",
      "organization": "Lumigo",
      "job_title": "",
      "title": "Serverless the hard parts",
      "description": "Serverless is a superpower, but with great power comes great responsibility. In this talk, let's look at the hard parts of serverless - including the need for system thinking, local development, testing, cost management and more - and how to tackle them..",
      "abstract": "Serverless is a superpower, but with great power comes great responsibility. In this talk, let's look at the hard parts of serverless - including the need for system thinking, local development, testing, cost management and more - and how to tackle them.",
      "audience_level": "All",
      "tags": [
        "aws",
        "serverless"
      ]
    }
  },
  {
    "agenda_details": {
      "start_time": "2025-10-21T10:25+02:00",
      "end_time": "2025-10-21T11:05+02:00",
      "minutes": 40,
      "type": "talk"
    },
    "talk": {
      "name": "Daniele Frasca",
      "avatar": "/speakers/daniele.jpg",
      "location": "Unknown",
      "bio": "Daniele is an AWS Serverless Community Builder. Daniele is focusing on building and architect serverless applications at scale. Daniele is architecting media services for millions of users in his current role, leveraging multi-region architecture with AWS Serverless service. Daniele is sharing his ideas on his blog, and he is pushing the limits using Rust to get the extra milliseconds required to give better experiences to final customers.",
      "twitter": "dfrasca80",
      "url": "https://dev.to/ymwjbxxq",
      "organization": "Seven.One Entertainment Group GmbH Ein Unternhmen der ProSiebenSat.1 Media SE",
      "job_title": "",
      "title": "What I learned building a Scalable, Highly Available Serverless Backend Across Multiple Regions",
      "description": "\"Because customers are watching TV right now, not planning to watch it tomorrow.\"\n\nThis simple truth has played a significant role in shaping the evolution of our architecture. We moved from a monolithic system that often experienced outages and required manual recovery to a resilient, distributed streaming platform.\n\nIn this presentation, I'll share how we tackled the challenge of single points of failure with some thoughtful architectural choices. Each evolution step was driven by one core principle: let AWS handle the infrastructure issues.\n\nThis presentation provides strategies for engineering teams building mission-critical applications where downtime is not just a technical issue - it's a direct impact to customer satisfaction and business success.",
      "abstract": "Multi-region applications were once complex and costly, but with \"serverless: infrastructure, it is not the case anymore. I will share what I learned in the last years running a multi-region production services and the benefits and disadvantages of achieving:",
      "audience_level": "Intermediate",
      "tags": [
        "serverless",
        "aws",
        "multi-region"
      ]
    }
  },
  {
    "agenda_details": {
      "start_time": "2025-10-21T11:10+02:00",
      "end_time": "2025-10-21T11:50+02:00",
      "minutes": 40,
      "type": "talk"
    },
    "talk": {
      "name": "Rafael Saraceni",
      "avatar": "/speakers/rafael-saraceni.png",
      "location": "Unknown",
      "bio": "Software Engineer specialised in AI Powered B2B SaaS. More than 10 years of experience building digital products from startups to enterprise in LatAm, Europe and Australia. ",
      "twitter": "",
      "url": "https://saraceni.me/",
      "organization": "EsgMax",
      "job_title": "",
      "title": "How I created a serverless AI Agent that helped more than 1k artists and music producers",
      "description": "In my spare time I love playing guitar. I use a music production software called Ableton Live to make beats and add effects to my guitar. This software is very complex and have thousands of features. Sometimes I had to navigate for hours on tutorials, videos and documentations to be able to make a simple beat or the desired effects on my guitar. Ableton is also very visual, it have complex elements with lots of tabs, buttons and knobs. Without being able to see what you have to interact with, it is very hard to navigate the UI, so putting the manual on a CustomGPT or a NotebookLM wouldn't work because these tools are textual only. This is why I decided to create an AI Agent using Typescript, Next.js, Vercel, AI SDK and Neon Serverless Postgres that was able to understand the manual and all the images and answer questions about this software. I decided also to make it Open Source and now it has helped more than 1k music producers and artists.",
      "abstract": "Ableton Live is one of the most popular softwares for music production. It has thousands of features and is very complex. I have created an Open Source AI Agent that helps users learn and use this software and it has helped more than 1k artists and music producers.",
      "audience_level": "Intermediate",
      "tags": [
        "serverless",
        "ai",
        "javascript"
      ]
    }
  },
  {
    "agenda_details": {
      "start_time": "2025-10-21T11:50+02:00",
      "end_time": "2025-10-21T12:10+02:00",
      "minutes": 20,
      "type": "break"
    },
    "break": {
      "title": "Coffee Break",
      "inline_abstract": "",
      "location": "",
      "description": ""
    }
  },
  {
    "agenda_details": {
      "start_time": "2025-10-21T12:10+02:00",
      "end_time": "2025-10-21T12:50+02:00",
      "minutes": 40,
      "type": "talk"
    },
    "talk": {
      "name": "Shani Kazaz & Uri Segev",
      "avatar": "",
      "location": "Unknown",
      "bio": "A people person, a serverless geek, and an innovation lover. I began my career at Amazon, helping customers build awesome products on the AWS cloud, and I loved every moment of it. Today, I focus on serverless&containers technologies and cutting-edge thinking.",
      "twitter": "Shani Adadi",
      "url": "#",
      "organization": "AWS",
      "job_title": "",
      "title": "Building Serverless AI Agents on AWS with Strands Agents SDK",
      "description": "AI Agents have revolutionized what's possible beyond traditional large language models (LLMs) and retrieval-augmented generation (RAG). Agentic systems can plan, reason, and act through dynamic multi-step tasks adjusted at every phase. In this session you'll learn how to build AI Agents on AWS Serverless compute (Lambda, Fargate), implement authentication, security, and observability, and connect it to remote MCP Servers.\nIn this session we will cover:\n* GenAI evolution\n* What constitutes an Agent\n* Building AI Agents on AWS (with Strands Agents SDK)\n* Adding context awareness, authentication, security, and observability\n* Extending AI Agent functionality with local tools\n* Connecting AI Agents to remote MCP Servers ",
      "abstract": "AI Agents go beyond LLMs and RAG by planning, reasoning, and adapting to dynamic tasks. Learn how to build agents on AWS Serverless, add authentication, security, and observability, and connect them to remote MCP servers.",
      "audience_level": "Advanced",
      "tags": [
        "serverless",
        "ai",
        "aws"
      ]
    }
  },
  {
    "agenda_details": {
      "start_time": "2025-10-21T12:55+02:00",
      "end_time": "2025-10-21T13:15+02:00",
      "minutes": 20,
      "type": "talk"
    },
    "talk": {
      "name": "Marko",
      "avatar": "/speakers/marko-serverlesslife.jpg",
      "location": "Slovenia",
      "bio": "Marko is an AWS-certified professional and serverless specialist with over 20 years of experience in the industry. Hi is an author of the blog Serverless Life (https://www.serverlesslife.com), where he shares insights on serverless architectures and best practices. He contributs to the open-source community with projects like Lambda Live Debugger (https://www.lldebugger.com) and Serverless Spy (https://serverlessspy.com). Dedication to serverless technology has earned him the title of AWS Community Builder.",
      "twitter": "ServerlessL",
      "url": "https://www.serverlesslife.com/",
      "organization": "ServerlessLife",
      "job_title": "",
      "title": "How to Lose Data Using AWS Serverless Without Even Knowing It",
      "description": "One of the biggest challenges in serverless development is the gap between how developers expect AWS services to behave and how they actually work. In many cases, this mismatch can lead to data loss or unexpected results. \n\nWe'll begin with DynamoDB'deceptively simple, yet packed with gotchas that can lead to silent data loss or misleading results. Then we'll examine pitfalls in event-driven architecture: from misconfigured queues and dead-letter queues to misunderstood EventBridge behaviors, stream processing and more.\n\nThen we'll zoom out to explore serverless design patterns that seem fine at first'but can quietly cause issues like event duplication, out-of-order processing, and data inconsistency if not handled with care.\n\nYou'll leave with real-world war stories, practical advice, and concrete examples of what not to do'plus tips to build resilient, predictable serverless systems. Even seasoned AWS developers will likely discover a few surprises.\n",
      "abstract": "One major drawback of serverless is that behavior often defies developer expectations. Without a deep understanding of AWS, you can easily lose data or get unexpected results. This talk dives into common traps and how to avoid them before they catch you.",
      "audience_level": "Intermediate",
      "tags": [
        "serverless",
        "aws"
      ]
    }
  },
  {
    "agenda_details": {
      "start_time": "2025-10-21T13:20+02:00",
      "end_time": "2025-10-21T14:00+02:00",
      "minutes": 40,
      "type": "talk"
    },
    "talk": {
      "name": "Enrico La Sala",
      "avatar": "/speakers/enrico-la-sala.jpeg",
      "location": "Marsala",
      "bio": "Computer Science Engineer passionate about technology, experienced in Backend Development, Frontend/DB Integration and System/DevOps Processes.\n\nhiop Co-Founder and CTO, main responsibilities in building software architectures that scale up in Cloud and manage technical and development team.\nAWS Community Builder in Serverless Category.\nFabLab Western Sicily Volunteer and Co-Founder, where I coordinate and partecipate in the technical activities and events in education.\n\nEnthusiast and supporter of DevOps processes, API, serverless, microservices and cloud adoption and migration.\n\nExperienced in Research Fields (Storage and High Performance Computing), in Banking Software Development and Integration and in developing digitalization plan in Public Administration.",
      "twitter": "enryls",
      "url": "https://www.linkedin.com/in/enricolasala",
      "organization": "Hiop",
      "job_title": "",
      "title": "Navigating Networking and Security in Serverless SaaS Platforms",
      "description": "Serverless architectures changed the way SaaS solutions are built, yet networking and security remain complex and critical to their success.\nAt my startup, we've been building a serverless data platform using cloud services from multiple providers, overcoming challenges that could have risked our project's integrity.\n\nIn this talk, I'll walk you through our journey and share practical strategies for tackling networking and security challenges in a serverless environment.\nI'll cover:\n- Serverless Networking Basics\n- Managing Connectivity\n- Advanced Security Measures\n- Scalability Planning\n\nAttendees will leave with actionable insights to streamline networking and security, enabling them to build secure, resilient, and high-performance SaaS platforms on.",
      "abstract": "Serverless has transformed SaaS development, but networking and security remain challenging. At my startup, we've built a serverless data platform using cloud services, this talk shares our journey and practical strategies for overcoming real-world challenges.",
      "audience_level": "Intermediate",
      "tags": [
        "multicloud",
        "aws",
        "gcloud",
        "infrastructure architectures",
        "azure",
        "serverless"
      ]
    }
  },
  {
    "agenda_details": {
      "start_time": "2025-10-21T14:00+02:00",
      "end_time": "2025-10-21T15:00+02:00",
      "minutes": 60,
      "type": "break"
    },
    "break": {
      "title": "Lunch",
      "inline_abstract": "",
      "location": "",
      "description": ""
    }
  },
  {
    "agenda_details": {
      "start_time": "2025-10-21T15:00+02:00",
      "end_time": "2025-10-21T15:30+02:00",
      "minutes": 30,
      "type": "talk"
    },
    "talk": {
      "name": "TBD",
      "avatar": "",
      "location": "",
      "bio": "",
      "twitter": "",
      "url": "#",
      "organization": "TBD",
      "job_title": "",
      "title": "TBD",
      "description": "",
      "abstract": "",
      "audience_level": "All",
      "tags": []
    }
  },
  {
    "agenda_details": {
      "start_time": "2025-10-21T15:30+02:00",
      "end_time": "2025-10-21T16:00+02:00",
      "minutes": 30,
      "type": "talk"
    },
    "talk": {
      "name": "Juarez Barbosa Junior",
      "avatar": "/speakers/juarez-barbosa-junior.png",
      "location": "",
      "bio": "Juarez Barbosa Junior is a Sr. Principal Java Developer Evangelist - Director of Developer Evangelism at Oracle. Previously, he was an Azure Developer Relations Lead at Microsoft and a Thought Leader and Technical Evangelist at IBM.\nHe has over 20 years of professional experience, having held senior leadership roles in DevRel, software engineering, and startup-related initiatives. His knowledge comprises Java, Python, Cloud Computing (Oracle OCI, Azure, GCP, IBM Cloud, and AWS), DevOps, IaC, CI/CD, and Cloud Native.",
      "twitter": "",
      "url": "#",
      "organization": "Oracle",
      "job_title": "",
      "title": "Scalable Multicloud with Serverless Java: Building Scalable Solutions with OCI Functions and Oracle Database@AWS",
      "description": "Serverless architectures are transforming how developers build and deploy applications, and Oracle Cloud Infrastructure (OCI) Functions brings this flexibility to enterprise-grade workloads. In this session, well dive into how Java developers can create and deploy OCI Functions that integrate seamlessly with Oracle Database, even when the database is deployed on AWS. Using a hands-on example, well walk through building a Java-based function, testing it locally, and deploying it to OCI Functions for production use.",
      "abstract": "",
      "audience_level": "",
      "tags": []
    }
  },
  {
    "agenda_details": {
      "start_time": "2025-10-21T16:10+02:00",
      "end_time": "2025-10-21T16:30+02:00",
      "minutes": 20,
      "type": "break"
    },
    "break": {
      "title": "Pausa",
      "inline_abstract": "",
      "location": "",
      "description": ""
    }
  },
  {
    "agenda_details": {
      "start_time": "2025-10-21T16:30+02:00",
      "end_time": "2025-10-21T17:10+02:00",
      "minutes": 40,
      "type": "talk"
    },
    "talk": {
      "name": "Walter Dal Mut",
      "avatar": "/speakers/walter-dal-mut.jpeg",
      "location": "Unknown",
      "bio": "Hi, I'm Walter Dal Mut, an engineer with a passion for building scalable, infrastructures on AWS. Over the years, I've worked across multiple sectors, helping teams design clean, maintainable, and production-ready systems.\n\nLately, I've been focused on real-time APIs with AWS AppSync, combining GraphQL Subscriptions, Cognito authentication, and Terraform to create secure and fully automated deployments. I care deeply about developer experience, Infrastructure as Code, and creating systems that are both powerful and easy to maintain.",
      "twitter": "walterdalmut",
      "url": "https://walterdalmut.com",
      "organization": "Corley SRL",
      "job_title": "",
      "title": "AWS AppSync Subscriptions and AWSCognito: Building Realtime Secure GraphQL APIs",
      "description": "In this talk, I'll walk through how to build a secure, real-time API using AWS AppSync with GraphQL Subscriptions, backed by Cognito authentication and deployed via Terraform as Infrastructure as Code.\n\nWe'll start with the fundamentals of AppSync and how it enables real-time capabilities using GraphQL Subscriptions over WebSockets. Then, we'll explore how to integrate Amazon Cognito to manage user authentication and fine-grained access control at the resolver level.\n\nBeyond just wiring services together, this session focuses on how to structure a clean, maintainable deployment using Terraform modules",
      "abstract": "In my talk, I'll introduce developers to how GraphQL Subscriptions work in AppSync, how to secure them with Cognito authentication, and how to use this combo to enable features like live dashboards, real-time notifications, or collaborative UIs ' all without managing infrastructure.",
      "audience_level": "All",
      "tags": [
        "aws",
        "serverless",
        "graphql",
        "appsync",
        "javascript"
      ]
    }
  },
  {
    "agenda_details": {
      "start_time": "2025-10-21T17:15+02:00",
      "end_time": "2025-10-21T17:55+02:00",
      "minutes": 40,
      "type": "talk",
      "keynote": true
    },
    "talk": {
      "name": "James Eastham",
      "avatar": "/speakers/james_eastham.jpg",
      "location": "",
      "bio": "James Eastham is a Serverless Developer Advocate at Datadog and a Microsoft MVP. He has over 10 years of software experience at all layers of the software development process and has spoken at conferences all over the world.\n\nHe answered phones in front-line support, administered databases, and built SSIS packages, as well as developed cloud-native backends with serverless technologies. He spent time at AWS working with some of the biggest companies on the planet, migrating workloads from data centers into the cloud and modernizing in the process.\n\nJames produces content on YouTube focused on architecting and building applications with serverless technologies using .NET and Rust. He also has a strong interest in and expertise in event-driven architecture and building more loosely coupled systems.",
      "twitter": "",
      "url": "#",
      "organization": "Datadog",
      "job_title": "",
      "title": "Why Should You Think Serverless First?",
      "description": "If youve dealt with complexity in your career, or youve looked at an architecture diagram and though wow, that looks complicated, this is the talk for you. Youre going to take a walk through some of the challenges with modern software development, the difference between complex and complicated and why you should care. \n\nBy the end of this talk, youll have a better understand what it means to be serverless in 2025. On what exactly serverless is solving for. And a clear set of heuristics for making the right technology choices for your workloads.",
      "abstract": "Many of you will be building, or thinking about building serverless systems. Your excited about getting your hands on all this new shiny tech, Lambda functions, Step Functions workflows, DynamoDB tables. Maybe even some serverless containers on Amazon ECS. But have you ever stopped to think, why SHOULD you be thinking serverless first? And isnt that introducing an element of complexity into your system?",
      "audience_level": "",
      "tags": [
        "azure",
        "serverless"
      ]
    }
  },
  {
    "agenda_details": {
      "start_time": "2025-10-21T18:00+02:00",
      "end_time": "2025-10-21T18:15+02:00",
      "minutes": 15,
      "type": "break"
    },
    "break": {
      "title": "Final remarks",
      "inline_abstract": "",
      "location": "",
      "description": ""
    }
  }
]