[
	{
		"agenda_details": {
			"start_time": "2024-06-13T09:00+02:00",
			"end_time": "2024-06-13T09:30+02:00",
			"minutes": 30,
			"type": "break"
		},
		"break": {
			"title": "Doors open, registration, breakfast",
			"inline_abstract": "",
			"location": "",
			"description": ""
		}
	},
	{
		"agenda_details": {
			"start_time": "2024-06-13T09:30+02:00",
			"end_time": "2024-06-13T09:45+02:00",
			"minutes": 15,
			"type": "break"
		},
		"break": {
			"title": "Welcome",
			"inline_abstract": "",
			"location": "",
			"description": ""
		}
	},
	{
		"agenda_details": {
			"start_time": "2024-06-13T09:45+02:00",
			"end_time": "2024-06-13T10:25+02:00",
			"minutes": 40,
			"type": "talk",
			"keynote": true
		},
		"talk": {
			"name": "Jeremy Daly",
			"avatar": "https://imgur.com/66yfarL.png",
			"location": "",
			"bio": "CEO and Co-founder at Ampt. AWS Serverless Hero. Jeremy is a passionate serverless advocate, an AWS Serverless Hero, and a senior technology leader with more than 25 years of experience building web and cloud applications. He is an active member of the serverless community, creating and contributing to open source serverless projects, and frequently works with companies looking to adopt serverless. Jeremy also writes extensively about serverless on his blog jeremydaly.com, publishes Off-by-none (offbynone.io), a weekly email newsletter that focuses on all things serverless, and hosts the Serverless Chats Podcast. He is currently the CEO of Ampt.",
			"twitter": "",
			"url": "",
			"organization": "Ampt",
			"job_title": "",
			"shirt_size": "",
			"title": "Productized Patterns: Exploring the next evolution of Serverless",
			"description": "In the rapidly evolving cloud landscape, serverless has become a transformative force, offering scalability, cost efficiency, and reduced operational overhead. However, the reality of selecting, customizing, and maintaining serverless patterns presents significant challenges, especially as applications grow in complexity and scale. This talk will introduce the innovative strategy of productized patterns, which standardizes common use cases into highly configurable, reusable, and adaptable components that address cross-service complexities like IAM permissions, state management, and failover mechanisms. We will explore how adopting productized patterns can streamline serverless workloads, making them more manageable, scalable, and efficient, and empower organizations to fully leverage the full power of the cloud.",
			"abstract": "",
			"audience_level": "Intermediate",
			"tags": [
				""
			]
		}
	},
	{
		"agenda_details": {
			"start_time": "2024-05-01T10:30+02:00",
			"end_time": "2024-05-01T11:10+02:00",
			"minutes": 40,
			"type": "talk",
			"keynote": false
		},
		"talk": {
			"name": "Andreea Merariu",
			"avatar": "https://imgur.com/NLHj1V9.jpg",
			"location": "London, United Kingdom",
			"bio": "Andreea is an AWS Community Builder and a Software Engineer at The Lego Group with a few years of experience in the industry. She has a passion for backend technologies but even more so for all things serverless. At the LEGO Group, she is designing and developing serverless applications on AWS. She is keen to engage with the community and constantly seeks new learning opportunities. Andreea is eager to share her journey into serverless and the interesting technical challenges she encounters along the way.",
			"twitter": "andreea_merariu",
			"url": "https://medium.com/@andreea.merariu",
			"organization": "The LEGO Group",
			"shirt_size": "Women's M",
			"job_title": "",
			"title": "Finding the correct destination for your serverless journey",
			"abstract": "Are you new to serverless destinations and want to learn more about them? Then look no further! This talk will give you an overview of the destination options, and then it will take you through a use case for each to solidify your understanding.",
			"description": "Like any other journey, a serverless journey will eventually lead you to a destination. While the journey is essential, choosing the right destination for your use case is just as valuable.\r\nIn the AWS world, you have a few destination options such as Lambda Destinations, EventBridge API Destinations and the external HTTP endpoint integration for AWS Step Functions.  In this talk, my first focus will be to bring visibility and an overview of each destination. Following this, I will bring a use case where each destination will be explored. The focus will then shift to taking a deep dive into each destination and understanding its intricacies. With the last milestone, I will leave you with my learnings and an understanding of serverless destinations.",
			"notes": "",
			"audience_level": "All",
			"tags": [
				"serverless",
				"AWS",
				"Lambda",
				"EventBridge",
				"AWS Step Functions"
			]
		}
	},
	{
		"agenda_details": {
			"start_time": "2024-05-01T11:15+02:00",
			"end_time": "2024-05-01T11:35+02:00",
			"minutes": 20,
			"type": "talk",
			"keynote": false
		},
		"talk": {
			"name": "Raphael Manke",
			"avatar": "./speakers/manke_raphael.jpeg",
			"location": "Karlsruhe - Germany",
			"bio": "Raphael is a full-stack web developer leveraging serverless technologies in his day to day business. He helps customers build reliable and scalable solutions with minimal operational overhead. On his cloud journey he shares his insights as a public speaker.",
			"twitter": "RaphaelManke",
			"url": "",
			"organization": "codecentric AG",
			"shirt_size": "Men's S",
			"title": "Supercharge Lambda functions with AWS Powertools",
			"abstract": "This talk gives the audience a new look on servereless architectures. Serverless is way more than just lambda functions. It shows multiple ways of solving a common problem by refactoring a real world application to an even more serverless version where you don't write code, just configuration.",
			"description": "Are you interested in learning about other options for building and deploying applications using serverless architecture? In this talk, we will explore alternatives to AWS Lambda, such as AWS EventBridge, Step Functions, and EventBridge Pipes. We will discuss the benefits and drawbacks of each option, as well as some real-world use cases. Additionally, we will examine how to reduce the number of Lambdas needed in your application by replacing them with configuration rather than code.\r\n\r\nTo demonstrate these concepts in action, we will also build a sample application using the AWS CDK framework. The AWS CDK is an open-source software development framework for defining cloud infrastructure in code and provisioning it through AWS CloudFormation. By using the CDK, we can leverage the power of familiar programming languages and modern software development practices to build and deploy cloud-native applications.\r\n\r\nBy the end of this talk, attendees will have a better understanding of the various serverless technologies available and how to choose the best option for their needs. They will also learn how to leverage these technologies and the AWS CDK to build and deploy cloud-native applications that are scalable, reliable, and cost-effective.",
			"audience_level": "Intermediate",
			"tags": [
				"aws",
				"cdk",
				"typescript",
				"serverless",
				"architecture"
			]
		}
	},
	{
		"agenda_details": {
			"start_time": "2024-06-13T11:40+02:00",
			"end_time": "2024-06-13T12:00+02:00",
			"minutes": 20,
			"type": "break"
		},
		"break": {
			"title": "Coffee Break",
			"inline_abstract": "",
			"location": "",
			"description": ""
		}
	},
	{
		"agenda_details": {
			"start_time": "2024-05-01T12:00+02:00",
			"end_time": "2024-05-01T12:40+02:00",
			"minutes": 40,
			"type": "talk"
		},
		"talk": {
			"name": "Luc van Donkersgoed",
			"avatar": "https://imgur.com/qhRIwns.jpg",
			"location": "Utrecht, The Netherlands",
			"bio": "",
			"twitter": "donkersgood",
			"url": "https://lucvandonkersgoed.com",
			"organization": "PostNL",
			"shirt_size": "Men's M",
			"name_2": null,
			"email_2": null,
			"avatar_2": null,
			"location_2": null,
			"bio_2": null,
			"twitter_2": null,
			"url_2": null,
			"organization_2": null,
			"shirt_size_2": null,
			"title": "Standing on the Shoulders of Giants - Embracing Serverless in the Enterprise",
			"abstract": "PostNL has been building a strictly serverless application landscape since 2018. In this talk we will tell our story: a short history of PostNL, why we chose serverless, the results we achieved, and the challenges we faced.",
			"description": "\r\n## Abstract\r\n\r\nIn the past 6 years, PostNL has built a landscape of over 70 serverless applications. We chose AWS serverless because it is a perfect match for our logistics processes, it is cost-effective, it allows us to focus on our business challenges, and it significantly reduces our operational overhead. But every decision in IT is a trade-off, and embracing serverless is no different. We will highlight the constraints we faced, the new skillsets required from our engineers, and the investment required for success.\r\n\r\nWe will conclude by making up the balance; what has serverless brought our enterprise, what has it cost, and was it worth it?\r\n\r\n## Target Audience\r\n\r\nThe target audience for \"Standing on the Shoulders of Giants - Embracing Serverless in the Enterprise\" are developers, architects, decision-makers and leaders who aim to win their market through cutting-edge software and infrastructure.\r\n\r\n## Audience Take-Away\r\n\r\nThe talk is successful when:\r\n* The audience has learned to critically assess the value of serverless, even in very large enterprises\r\n* The audience has learned adopting serverless is a matter of trade-offs\r\n* The audience has learned that a stronger commitment to a platform will exponentially increase the benefits gained\r\n\r\n## Duration\r\n\r\nThe talk takes about 30 minutes, or 45 minutes with Q\u0026A.\r\n\r\n## About the speaker\r\n\r\nLuc is an AWS Serverless Hero and Principal Engineer at PostNL, where he designs and builds enterprise-scale serverless architectures. He is well known for his articles, presentations, videos, and podcasts about AWS. You can find Luc on Twitter (https://twitter.com/donkersgood), Mastodon (https://hachyderm.io/@donkersgoed), and LinkedIn (https://www.linkedin.com/in/donkersgoed)\r\n",
			"audience_level": "Beginner",
			"tags": []
		}
	},
	{
		"agenda_details": {
			"start_time": "2024-05-01T12:45+02:00",
			"end_time": "2024-05-01T13:05+02:00",
			"minutes": 20,
			"type": "talk"
		},
		"talk": {
			"name": "Marko Djakovic",
			"avatar": "https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/102332/JAK05933.jpg",
			"location": "Novi Sad, Serbia",
			"bio": "Software Architect \u0026 Tech Lead with a 10 year experience in software development. Involved in different projects from heavy enterprises to start-ups. Fell in love with Serverless and AWS somewhere along the way. Third consecutive year participating in AWS Community Builders for Serverless.",
			"twitter": "",
			"url": "https://dev.to/imflamboyant",
			"organization": "",
			"job_title": "",
			"shirt_size": "Men's L",
			"name_2": null,
			"email_2": null,
			"avatar_2": null,
			"location_2": null,
			"bio_2": null,
			"twitter_2": null,
			"url_2": null,
			"organization_2": null,
			"shirt_size_2": null,
			"title": "Developing Serverless Java Solutions Like a Boss",
			"abstract": "Developing Java with Serverless? Did turning on Lambda SnapStart just magically solve all your problems? I didn't think so. Dive into new perspectives and discover techniques to optimize your development workflow using AWS CDK with Java, through examples with Spring Boot and Spring Cloud Function.",
			"description": "Developing Java with Serverless? Did turning on Lambda SnapStart just magically solve all your problems? I didn't think so. Dive into new perspectives and discover techniques to optimize your development workflow using AWS CDK with Java. Through examples with Spring Boot and Spring Cloud Function, explore code organization strategies and learn how to leverage the power of direct service integrations offered by AWS.\r\n\r\nIn this talk, we will explore practices of organizing your code into multi-module projects, combining Lambda functions with various AWS services like API Gateway, Cognito, DynamoDB, but also EventBridge and SQS for asynchronous processing. All this developed and deployed using AWS CDK, while also addressing why SnapStart is not a silver bullet and when it can even be unnecessary.\r\n\r\nPrepare to be inspired and walk away with fresh ideas to transform your Java applications into agile, efficient, and truly Serverless solutions.",
			"audience_level": "Intermediate",
			"tags": [
				"aws",
				"serverless",
				"java",
				"spring",
				"cdk"
			]
		}
	},
	{
		"agenda_details": {
			"start_time": "2024-05-01T13:10+02:00",
			"end_time": "2024-05-01T13:50+02:00",
			"minutes": 40,
			"type": "talk"
		},
		"talk": {
			"name": "Nicola Cremaschini",
			"avatar": "https://imgur.com/6pR1YX9.png",
			"location": "Unknown",
			"bio": "I'm an old school developer, I started 20 years ago with Notepad as an IDE (?), then I worked as DevOps and for a few years now I've been working as a Principal Technical Architect. I'm interested in cloud computing and serverless architectures and love to dive deep into problems and find smart solutions.",
			"twitter": "",
			"url": "https://haveyoutriedrestarting.com",
			"organization": "Sky Italy",
			"shirt_size": "Men's M",
			"title": "Sky’s the Limit: Lessons and Learnings in Scaling Serverless at Sky Italia",
			"abstract": "Is Serverless the new way to go, at any cost and every scale?\nSky Italia adopted a serverless-first approach in its milion-DAU digital properties, and is willing to share its experience, benefits gained, limits encountered, pitfalls and mistakes.",
			"description": "In this presentation, we explore the critical question, \"Is Serverless the new way to go, at any cost and every scale?\" Reflecting on Sky Italia's shift to a serverless-first approach for our million-DAU digital properties, we aim to provide a comprehensive and candid look into this decision. We'll share insights into the tangible benefits we've achieved, the challenges and limitations we've faced, and the practical pitfalls and missteps encountered along the way. This talk is designed for professionals and enthusiasts alike, seeking an honest and detailed exploration of the serverless paradigm in high-traffic environments. Join us for an engaging session that goes beyond the hype, offering real-world lessons and strategies from Sky Italia's journey in the serverless landscape.",
			"audience_level": "All",
			"tags": [
				"aws",
				"limits",
				"architecture",
				"pitfalls",
				"serverless"
			]
		}
	},
	{
		"agenda_details": {
			"start_time": "2024-05-01T14:00+02:00",
			"end_time": "2024-05-01T15:00+02:00",
			"minutes": 60,
			"type": "break"
		},
		"break": {
			"title": "Lunch Break",
			"inline_abstract": "Take a break and grab a lunch",
			"location": "Cafeteria",
			"description": "(dropdown) menu The menu is: fried rice, chicken curry, and salad"
		}
	},
	{
		"agenda_details": {
			"start_time": "2024-05-01T15:00+02:00",
			"end_time": "2024-05-01T15:40+02:00",
			"minutes": 40,
			"type": "talk",
			"keynote": true
		},
		"talk": {
			"name": "Anahit Pogosova",
			"avatar": "https://imgur.com/f2vHxDB.jpg",
			"location": "Unknown",
			"bio": "Anahit brings over a decade of experience in full-stack and data solutions to her roles as an AWS Data Hero and a Lead Cloud Software Engineer at Solita, one of Finland's leading digital transformation companies. Anahit passionately shares her knowledge with the community through various channels, including conferences and meetups, podcasts and YouTube, as well as blogging and online courses.",
			"twitter": "",
			"url": "",
			"organization": "",
			"shirt_size": "Men's M",
			"title": " The art of embracing failures",
			"description": "Nowadays serverless can mean many different things. Among others, it helps split bigger tasks into smaller pieces and run them in parallel, leveraging the power of distributed systems. It's also fun! And it's seemingly easy, almost magic-like! However, the real world is more nuanced than that. With all the power that distributed systems have given us, comes responsibility. In this talk, learn the most common challenges and pitfalls inferent to distributed systems and the ways to mitigate them. Delve into some real-world examples using two of the essential AWS serverless services: AWS Lambda and Amazon Kinesis. And most importantly, learn to embrace failures. Because as the CTO of Amazon Dr. Werner Vogels likes to say: everything fails, all the time.",
			"abstract": "",
			"audience_level": "All",
			"tags": [
				"aws",
				"limits",
				"architecture",
				"pitfalls",
				"serverless"
			]
		}
	},
	{
		"agenda_details": {
			"start_time": "2024-05-01T15:45+02:00",
			"end_time": "2024-05-01T16:05+02:00",
			"minutes": 20,
			"type": "talk"
		},
		"talk": {
			"name": "Matteo Madeddu",
			"avatar": "https://imgur.com/D0Tg00c.jpg",
			"location": "Torino",
			"bio": "Sono un Platform Engineer di Torino, che lavora da tempo con i servizi AWS. Nel corso degli anni ho maturato esperienze con diversi tipi di architetture AWS-powered, da quelle serverless-driven che sfruttano servizi come AWS ApiGateway, Lambda, IoT Core, Fargate e soluzioni Cloudwatch ad ambienti completi ec2-backed che utilizzano più cluster EKS. Mi piace sperimentare, soprattutto con AWS, e cercare di ottenere il massimo dai suoi servizi! ",
			"twitter": "",
			"url": "https://madeddu.xyz/",
			"organization": "Prima Assicurazioni",
			"shirt_size": "Men's L",
			"title": "AWS CDK and stack inheritance unveil the the power of serverless infrastructures composition",
			"abstract": "Explore AWS CDK for a modular serverless backend powered by AWS-managed services. Begin with a simple upload form ending up with a serverless OCR backend. CDK enables endless scenarios and promotes infrastructure reuse/modularity via stack inheritance, facilitating iterative complex infrastructures.",
			"description": "This session will show how to leverage AWS Cloud Development Kit (AWS CDK) to build a modular backend consisting of reusable and extensible stacks. Starting with a basic scenario for building the backend of a simple serverless upload form, with minimal modifications and reusing the entire code already written, we will first build a producer/consumer chain and then the backend for a serverless OCR application that makes use of fully managed services such as Polly and Rekognition. Such an infrastructure could meet the needs of an application to help visually impaired people in their daily lives. This and a thousand other scenarios can be built with AWS CDK, which allows concepts such as infrastructure reuse and modularity to be put into practice like never before, thanks to the expressive power of stack inheritance, unveiling an infinity of scenarios and allowing increasingly complex infrastructures to be built iteratively.",
			"audience_level": "Intermediate",
			"tags": [
				"aws",
				"cdk",
				"typescript"
			]
		}
	},
	{
		"agenda_details": {
			"start_time": "2024-06-13T16:10+02:00",
			"end_time": "2024-06-13T16:30+02:00",
			"minutes": 20,
			"type": "break"
		},
		"break": {
			"title": "Coffee Break",
			"inline_abstract": "",
			"location": "",
			"description": ""
		}
	},
	{
		"agenda_details": {
			"start_time": "2024-05-01T16:30+02:00",
			"end_time": "2024-05-01T17:10+02:00",
			"minutes": 40,
			"type": "talk"
		},
		"talk": {
			"name": "Daniele Frasca, Roman Boiko",
			"avatar": "https://imgur.com/SFrP6kI.jpeg",
			"bio": "Daniele is an AWS Serverless Community Builder. Daniele is focusing on building and architect serverless applications at scale. Daniele is architecting media services for millions of users in his current role, leveraging multi-region architecture with AWS Serverless service. Daniele is sharing his ideas on his blog, and he is pushing the limits using Rust to get the extra milliseconds required to give better experiences to final customers.",
			"twitter": "dfrasca80",
			"url": "https://dev.to/ymwjbxxq",
			"organization": "ProSiebenSat.1, AWS",
			"shirt_size": "Men's 2XL",
			"title": "Serverless architecture as enabler for low code solutions",
			"abstract": "ProSiebenSat.1 Media SE's event-driven architecture and no-code development methodology is genuinely inspiring. By adopting this strategy, they have achieved faster time-to-market for their streaming app, JOYN, while enabling greater scalability and collaboration and significantly reducing costs.",
			"description": "ProSiebenSat.1 Media SE is one of the largest German television companies operating in the entertainment sector, offering various products. Joyn, their streaming application used in the DACH regions across multiple platforms, faces many challenges. Serving millions of customers during significant events such as popular shows or live sports events is crucial, where customers expect a fast, seamless experience. Slow responses or unavailability can lead to frustration, dissatisfaction, and loss of trust. It is hard to predict the number of requests because several factors, such as the event's popularity and marketing efforts, can influence it. The \"core teams\" must design the system to handle high loads. Developing and implementing a robust and scalable system that can endure sudden spikes in traffic is essential. Because of the speed of the entertainment market, it is crucial to ensure that applications can be maintained and extended easily without having to rebuild from scratch every time. My experience leading the ContentDiscovery team has been transformative. I have leveraged a serverless-first approach, event-driven architecture, and no-code development methodology. This combination has allowed for rapid scalability and fundamentally altered how we approach backend unification. Introducing serverless technologies has empowered our team to build a robust and scalable system. The integration of no-code development has been a game-changer in efficiency and innovation. It enables quick prototyping and testing of new features, significantly shortening our product development lifecycle. The versatility of serverless and no-code solutions has facilitated team expansion without requiring deep serverless knowledge. This has allowed us to build a diverse and skilled team capable of navigating the intricacies of our streaming applications. The no-code approach has simplified onboarding processes, enabling team members to contribute effectively without the steep learning curve.\r\nMoreover, combining serverless events and a no-code approach has resulted in substantial cost savings. It has accelerated time to market and reduced overall development costs by freeing developers from focusing on complex tasks and seamlessly integrating with existing applications and data sources. In essence, the marriage of serverless technologies, event-driven architecture, and a no-code approach has propelled our ContentDiscovery team into a realm of faster innovation, heightened agility, and simplified collaboration. It has not only met the challenge of unifying our backend into a single, scalable system but has also set the stage for continuous growth, ensuring that our applications remain maintainable and extensible in the ever-evolving entertainment market landscape.",
			"audience_level": "All",
			"tags": [
				"serverless",
				"event-driven",
				"aws"
			]
		}
	},
	{
		"agenda_details": {
			"start_time": "2024-05-01T17:15+02:00",
			"end_time": "2024-05-01T17:55+02:00",
			"minutes": 40,
			"type": "talk"
		},
		"talk": {
			"name": "Eric Johnson",
			"email": "",
			"avatar": "https://imgur.com/Kfha39v.jpeg",
			"bio": "Eric Johnson is a Principal DA for serverless at AWS and speaks on serverless, EDA, and GenAI at events around the world. He has a passion for helping developers build robust applications on serverless while utilizing best practices and the latest technologies. Eric loves to help developers at any skill level and splits his time speaking to the pros in tech conferences as well as the up and coming in universities.",
			"twitter": "",
			"url": "",
			"organization": "AWS",
			"shirt_size": "Men's 2XL",
			"title": "Now serverless is all grown up, what's next?",
			"description": "Since Lambda pioneered the concept of serverless 10 years ago, it’s matured into a standard way for developers to build applications. With so many services adopting the serverless moniker, many Builders are asking, \"What's next?\" In this session, I revisit the core tenets serverless and show how you can embrace the benefits of a service-driven approach to solve the next wave of challenges. We now have all the tools needed to tackle the “hard problems” of managing GenAI, wrangling data at scale, and more. By the end of this session, you'll see how serverless is just getting started, and it's ready to bring the future to your applications.",
			"abstract": "",
			"audience_level": "All",
			"tags": [
				"serverless",
				"event-driven",
				"aws"
			]
		}
	},
	{
		"agenda_details": {
			"start_time": "2024-06-13T18:00+02:00",
			"end_time": "2024-06-13T18:15+02:00",
			"minutes": 15,
			"type": "break"
		},
		"break": {
			"title": "Final remarks",
			"inline_abstract": "",
			"location": "",
			"description": ""
		}
	},
	{
		"agenda_details": {
			"start_time": "2024-06-13T18:15+02:00",
			"end_time": "2024-06-13T21:00+02:00",
			"minutes": 15,
			"type": "break"
		},
		"break": {
			"title": "Happy hour",
			"inline_abstract": "",
			"location": "",
			"description": ""
		}
	}
]